var protocolText = "  欢迎申请使用杭州猫小贩科技有限公司（以下简称“本公司”）提供的转一转有奖平台服务（“转一转”指用户使用微信或支付宝支付相应金额，即可参与转一转活动），请您（下列简称为“用户”）仔细阅读以下内容。如用户不同意本服务条款任意内容，请勿继续使用转一转。如用户通过扫码进入点击转一转并勾选“我已阅读并同意《服务协议》”，即表示用户与本公司已达成协议，自愿接受本服务条款的所有内容。此后，用户不得以未阅读本服务条款内容作任何形式的抗辩。\n\n"+
"一、用户使用转一转的前提条件 \n"+
"1、用户通过扫描设备屏幕或者机身的二维码，微信或支付宝支付相应金额后获得参与转一转活动资格。\n\n"+
"2、用户在使用转一转时须具备相应的权利能力和行为能力，能够独立承担法律责任，如果用户在18周岁以下，必须在父母或监护人的监护下使用。\n\n"+
"二、用户管理\n"+
"1、用户ID\n"+
"  用户扫码进入后，经过第三方授权登录（微信或支付宝）转一转时，本公司会为每位用户生成一个帐户ID，作为其使用转一转服务的唯一身份标识，用户需对其帐户项下的所有行为负责。\n\n"+
"2、用户资料\n"+
"  用户在使用转一转时个人资料均来源于微信或支付宝，用户资料包括但不限于个人用户头像、昵称、性别等信息。\n"+
"  若用户帐号ID或帐号头像、昵称等资料存在违法信息的，本公司有权采取暂停使用等措施。\n\n"+
"3、用户应当保证在使用转一转的过程中遵守诚实信用原则，不扰乱转一转的正常秩序，不得通过使用他人帐户、一人使用多个帐户、使用程序自动处理等非法方式损害他人或本公司的利益。\n\n"+
"4、若用户存在任何违法或违反本服务协议约定的行为，本公司有权视用户的违法或违规情况适用以下一项或多项处罚措施：\n"+
"（1）责令用户改正违法或违规行为；\n"+
"（2）中止、终止部分或全部服务；\n"+
"（3）取消用户转一转资格并取消商品的发放；\n"+
"（5）符合法律法规规定的情况下，本公司认为合适的其他措施。\n"+
"  若用户的行为造成本公司及其关联公司损失的，用户还应承担赔偿责任。\n\n"+
"三、转一转的规则\n"+
"1、释义\n"+
"  用户需要选择参与活动的一个或多个商品（最多三个），然后根据选择的倍率支付响应金额（商品数量×倍率）后直接参与活动。本公司根据用户支付金额产生的微信或支付宝交易订单号末尾十位数字（此交易订单号由支付宝或微信等第三方支付平台生成，本公司无权限控制）除以商品合计价格（以分为单位，所有商品价格总和），然后根据所选商品价格顺序排列，若所得余数分别商品价格前列的支付金额区间，则可免费获得选购的商品，若不在则表示未中奖金额不予退还。\n\n"+

"2、本公司承诺遵循公平、公正、公开的原则提供转一转服务，确保所有用户在转一转中享受同等的权利与义务，结果向所有用户公示。\n\n"+

"3、用户知悉，除本协议另有约定外，无论是否获得商品，用户用于参与转一转的金额不能退回；其完全了解参与转一转活动的存在风险，本公司不保证用户参与转一转一定会获得商品。\n\n"+

"4、用户通过参与转一转获得商品，设备将立即出货，请用户立即在设备取货，否则视为放弃该商品，用户因此行为造成的损失，本公司不承担任何责任。\n\n"+

"5、用户通过参与转一转获得的商品，如有质量问题，请致电联系设备运营客服。\n\n"+

"6、如果下列情形发生，本公司有权取消用户在转一转相关服务：\n"+
"（1）因不可抗力，本系统发生故障或遭受第三方攻击，或发生其他本公司无法控制的情形；\n"+
"（2）根据本公司已经发布的或将来可能发布或更新的各类规则和规定取消的。\n\n"+
"四、本服务协议的修改\n"+
"  用户知晓本公司不时公布或修改的与本服务协议有关的规则、条款及公告是本服务协议的组成部分。本公司有权在必要时通过在转一转内发出公告等合理方式修改本服务协议，用户在享受各项服务时，应及时查阅了解修改的内容，并自觉遵守本服务协议。用户如继续使用本服务协议涉及的服务，则视为对修改内容的同意，如发生争议，以最新的服务协议为准；用户在不同意修改内容的情况下，有权停止使用本服务协议涉及的服务。\n"+
"如用户对本规则内容有任何疑问，可拨打客服电话联系本公司\n\n"+
"五、免责声明\n"+
"  本公司只提供有奖平台服务，不参与实际运营，故本公司不承担在运营过程中的任何问题。"
